# Create a clock constraint for the input clock 'clk'
create_clock -period 20.000 -name clk -add [get_ports clk]

# Define input delay constraints
# Assuming a max input delay of 3 ns and a min input delay of 1 ns for all data_in ports
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_0]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_1]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_2]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_3]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_4]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_5]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_6]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_7]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_8]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_9]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_10]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_11]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_12]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_13]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_14]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_15]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_16]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_17]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_18]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_19]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_20]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_21]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_22]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_23]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_24]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_25]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_26]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_27]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_28]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_29]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_30]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_in_31]

set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_0]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_1]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_2]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_3]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_4]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_5]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_6]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_7]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_8]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_9]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_10]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_11]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_12]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_13]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_14]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_15]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_16]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_17]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_18]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_19]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_20]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_21]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_22]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_23]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_24]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_25]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_26]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_27]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_28]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_29]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_30]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_in_31]

# Define output delay constraints
# Assuming a max output delay of 3 ns and a min output delay of 1 ns for all data_out ports
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_0]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_1]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_2]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_3]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_4]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_5]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_6]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_7]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_8]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_9]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_10]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_11]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_12]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_13]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_14]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_15]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_16]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_17]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_18]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_19]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_20]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_21]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_22]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_23]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_24]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_25]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_26]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_27]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_28]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_29]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_30]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports data_out_31]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_0]

set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_1]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_2]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_3]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_4]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_5]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_6]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_7]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_8]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_9]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_10]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_11]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_12]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_13]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_14]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_15]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_16]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_17]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_18]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_19]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_20]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_21]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_22]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_23]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_24]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_25]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_26]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_27]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_28]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_29]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_30]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports data_out_31]

# Define input delay constraint for the 'i_z' signal
# Assuming a max input delay of 3 ns and a min input delay of 1 ns
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports i_z]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports i_z]

# Define input delay constraint for the 'i_valid' signal
# Assuming a max input delay of 3 ns and a min input delay of 1 ns
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports i_valid]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports i_valid]

# Define output delay constraint for the 'o_valid' signal
# Assuming a max output delay of 3 ns and a min output delay of 1 ns
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports o_valid]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports o_valid]

# If there are any false paths or multi-cycle paths
# set_false_path -from [get_ports some_input_signal] -to [get_ports some_output_signal]
set_false_path -from [get_ports data_in_8[7]] -to [get_cells r_data_in_reg[8][7]]

# set_multicycle_path -from [get_ports some_input_signal] -to [get_ports some_output_signal] 2

